tutorials/multiform/resolvedSimulations/reactivePacking3Dstl/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// momentumSource
// {
//     type            meanVelocityForce;
//
//     selectionMode   all;
//
//     fields          (U);
//     Ubar            (1 0 0);
// }


// ************************************************************************* //
