tutorials/multiform/resolvedSimulations/reactivePacking3Dstl/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0.01;
		maxIter 		15;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        type            coupled;  // optional, defaults to segregated
        solver          PBiCCCG;
        preconditioner  DILU;
        tolerance       (1e-12 1e-12 1e-12);
        relTol          (0.01 0.01 0.01);

        //solver          GAMG;
        //smoother        DILU;
        //tolerance       1e-12;
        //relTol          0.01;
    }

    T
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
    }

}

SIMPLE
{

    #include    "residualControl"

    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
    consistent yes;
}

relaxationFactors
{
    fields
    {
        p               1;
        U               1;
    }
     equations
     {
         U             0.999;
         T               1;
     }
}




// ************************************************************************* //
